In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv("C:\\Users\\HP\\Downloads\\placement.csv")

In [5]:
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [6]:
df.tail()

    cgpa  resume_score  placed
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

In [7]:
df.describe()

           cgpa  resume_score      placed
count  100.0000    100.000000  100.000000
mean     6.9422      6.930500    0.500000
std      1.1192      0.979608    0.502519
min      5.2700      4.950000    0.000000
25%      5.9800      6.190000    0.000000
50%      6.6200      7.055000    0.500000
75%      8.0450      7.640000    1.000000
max      9.4000      9.060000    1.000000

In [8]:
df.info

<bound method DataFrame.info of     cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]>

In [9]:
df.dtypes

cgpa            float64
resume_score    float64
placed            int64
dtype: object

In [10]:
df.columns

Index(['cgpa', 'resume_score', 'placed'], dtype='object')

In [11]:
top_left_corner_df = df.iloc[:5 , :3]
top_left_corner_df

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [12]:
df.empty

False

In [13]:
df.isnull()

     cgpa  resume_score  placed
0   False         False   False
1   False         False   False
2   False         False   False
3   False         False   False
4   False         False   False
..    ...           ...     ...
95  False         False   False
96  False         False   False
97  False         False   False
98  False         False   False
99  False         False   False

[100 rows x 3 columns]

In [14]:
df['cgpa'].isnull()

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Name: cgpa, Length: 100, dtype: bool

In [16]:
df.isnull().sum() # total of missing values in a df

cgpa            0
resume_score    0
placed          0
dtype: int64

In [17]:
df['cgpa'].isnull().sum()

0

In [20]:
df.shape  #n(row) ,n(columns)

(100, 3)

In [21]:
df.size  #n(row) * n(columns)

300

In [23]:
# df.values Give all the values in the array

In [24]:
# df = df.copy

In [25]:
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [26]:
df.sort_values(by = 'cgpa')

    cgpa  resume_score  placed
79  5.27          7.28       0
6   5.34          7.09       0
92  5.43          6.18       0
11  5.44          6.54       0
49  5.46          6.73       0
..   ...           ...     ...
34  8.87          7.19       1
15  8.88          5.93       1
37  9.05          8.21       1
93  9.31          7.39       1
76  9.40          5.50       1

[100 rows x 3 columns]

In [27]:
df.sort_index()  #it will sort your indexing in ascending order

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [28]:
df = df.astype(int) #how to change data type of  data frame

In [29]:
df.add(4)

    cgpa  resume_score  placed
0     12            10       5
1     10             9       4
2     12            12       5
3     10            11       5
4     11            11       5
..   ...           ...     ...
95    10            10       4
96    12            11       5
97    10            11       4
98    12             9       5
99    10            10       4

[100 rows x 3 columns]

In [31]:
df['Vinu'] = df['cgpa'].add(10)

In [32]:
df

    cgpa  resume_score  placed  Vinu
0      8             6       1    18
1      6             5       0    16
2      8             8       1    18
3      6             7       1    16
4      7             7       1    17
..   ...           ...     ...   ...
95     6             6       0    16
96     8             7       1    18
97     6             7       0    16
98     8             5       1    18
99     6             6       0    16

[100 rows x 4 columns]

In [35]:
df = df.drop(columns = ['Vinu'] , axis = 1) #how to remove single or multiple columns axis = 1 is vertically

In [ ]:
df

In [36]:
df.count() #total elements in the column

cgpa            100
resume_score    100
placed          100
dtype: int64

In [37]:
df.max()

cgpa            9
resume_score    9
placed          1
dtype: int32

In [38]:
df.min()

cgpa            5
resume_score    4
placed          0
dtype: int32

In [41]:
df['cgpa'].min()

5

In [42]:
df.mean()

cgpa            6.47
resume_score    6.47
placed          0.50
dtype: float64

In [43]:
df.median()

cgpa            6.0
resume_score    7.0
placed          0.5
dtype: float64

In [44]:
df.sum()

cgpa            647
resume_score    647
placed           50
dtype: int64

In [45]:
df.filter(items = ['cgpa', 'placed'])

    cgpa  placed
0      8       1
1      6       0
2      8       1
3      6       1
4      7       1
..   ...     ...
95     6       0
96     8       1
97     6       0
98     8       1
99     6       0

[100 rows x 2 columns]

In [46]:
df.filter(items = [5,6,7] , axis = 0)

   cgpa  resume_score  placed
5     8             6       1
6     5             7       0
7     6             6       0

In [47]:
df.filter(like = '5', axis = 0) #like operator

    cgpa  resume_score  placed
5      8             6       1
15     8             5       1
25     7             5       1
35     8             7       1
45     8             5       1
50     8             6       1
51     6             7       0
52     5             7       0
53     6             7       0
54     5             7       0
55     6             6       1
56     6             6       0
57     6             7       0
58     6             7       0
59     5             7       0
65     6             8       0
75     6             7       1
85     6             5       0
95     6             6       0

In [ ]:
# df.to_dict()